/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
                                                                bh_energy01.ino
                                            Copyright © 2020, Zigfred & Nik.S
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
  Arduino Pro Mini:
  Скетч использует 6682 байт (21%) памяти устройства. Всего доступно 30720 байт.
Глобальные переменные используют 534 байт (26%) динамической памяти, 
оставляя 1514 байт для локальных переменных. Максимум: 2048 байт.
/*****************************************************************************\
  Arduino Pro Mini boiler_house_energy1 выдает данные:
    аналоговые:
  величины переменного электрического тока
/*****************************************************************************/

//  Блок DEVICE  --------------------------------------------------------------
//  Arduino Pro Mini
#define DEVICE_ID "boiler_house_energy1"
#define VERSION 1

//  Блок libraries  -----------------------------------------------------------
#include <SoftEasyTransfer.h>            //   pins D13, D12, D11 
#include <SoftwareSerial.h>
#include <EmonLib.h>

//  Блок settings  ------------------------------------------------------------
#include "bh_energy1_init.h"

//	end init  -----------------------------------------------------------------


/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            setup
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void setup() {
  Serial.begin(9600);
  Serial.println("Serial.begin(9600)");

  emonMultipleSetup();
  SoftEasyTransferSetup();

}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            loop
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void loop() {

  delay(30);
  digitalWrite(DIR, LOW);  // включаем прием
  delay(33);

  receiveData();  // если пришли данные

  //  resetWhen30Days();

/*    test
  for ( int i = 13 ; i < 16 ; i++) {
    current[i] = emonMultiple(i);
    Serial.print("  current");
    Serial.print(i);
    Serial.print("=");
    Serial.print(current[i]);
  }
  Serial.println();
*/
}

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            info
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
  25.03.2020 v1
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            end
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
