/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            receiveData()
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void receiveData() {
if (ETin0.receiveData()) {                         // если пришли данные
    
    byte id = rxdata0.ID; // читаем байт, в нем для кого этот пакет

    if (id == ID) { // и если пакет пришел нам
          }

      if (rxdata0.action == "get") {
        sendTxData();
      }
  }

}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
 
