/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
                                                                bh_energy.ino 
                                            Copyright © 2020, Zigfred & Nik.S
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\                            
  Arduino Mega2560:
Скетч использует 14302 байт (5%) памяти устройства. Всего доступно 253952 байт.
Глобальные переменные используют 635 байт (7%) динамической памяти,
оставляя 7557 байт для локальных переменных. Максимум: 8192 байт.
/*****************************************************************************\
  Сервер boiler_house_energy выдает данные:
    аналоговые: 
величины электрического тока 
    
/*****************************************************************************/

//  Блок DEVICE  --------------------------------------------------------------
//  Arduino Mega2560
#define DEVICE_ID "boiler_house_energy"
#define VERSION 1

//  Блок libraries  -----------------------------------------------------------
#include <Ethernet2.h>          //  httpServer (40115) pins D10,D11,D12,D13
#include <SoftEasyTransfer.h>            //   pins D7, D8, D9

//  Блок settings  ------------------------------------------------------------
#include "bh_energy_init.h"

unsigned long currentTime;

//	end init  -----------------------------------------------------------------

 
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            setup
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void setup() {
  Serial.begin(57600);
  Serial.println("Serial.begin(57600)"); 

  httpServerSetup();
  SoftEasyTransferSetup();

}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            loop
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void loop() {
  
  realTimeService();
////
unsigned long deltaTime = millis() - currentTime;
  
  if (deltaTime > 15000)
  {
        digitalWrite(DIR, HIGH);                      // включаем передачу
delay(111);
    sendTxData();
    
    currentTime = millis();
Serial.println(millis()); 
    delay(1111);
    digitalWrite(DIR, LOW);  // включаем прием
    delay(111);
  }
//  if(ETin1.receiveData()){ // если пришли данные
  
//    Serial.println("     If  (ETin1.receiveData())");
  
  
    receiveDataETin1();
  //  } 
  
//  resetWhen30Days();
 
}

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            info
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\

25.03.2020 v1  
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            end
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
 
