/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            Прием данных  от ардуины 
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void receiveDataETin0() {

  //   byte id = rxdata.ID; // читаем байт, в нем для кого этот пакет
  //   if (id == 01){ // и если пакет пришел нам от ардуины №1

  current_01 = rxdata0.current01;    //  №1 
  current_02 = rxdata0.current02;    //  №2 
  current_03 = rxdata0.current03;    //  №3

}

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
