/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            Передача данных к ардуине 
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void sendTxData() {

    digitalWrite(DIR, HIGH);                      // включаем передачу

ID = 11;              // номер ардуины
action = "get";    //  "get"/"set" - запрос выдачи данных / команда на исполнение

    txdata.ID = ID;
    txdata.action = action;
    
    delay(30);   
    ETout1.sendData();
    delay(30);   
    
}

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
 
